In [1]:
import numpy as np
import pandas as pd

In [2]:
# https://jalammar.github.io/gentle-visual-intro-to-data-analysis-python-pandas/

# Series

In [3]:
# Tek boyutludur
names = ["Ensar","Erva","Muhammed"]
notes = [70,60,65]

In [4]:
result=pd.Series(data=notes, index=names)
print(result)

Ensar       70
Erva        60
Muhammed    65
dtype: int64

In [5]:
notes2 = [10,20,30]
result2=pd.Series(data=notes2, index=names)
print(result2)

Ensar       10
Erva        20
Muhammed    30
dtype: int64

In [6]:
print(result+result2)
print()
print(result-result2)

Ensar       80
Erva        80
Muhammed    95
dtype: int64

Ensar       60
Erva        40
Muhammed    35
dtype: int64

# DataFrame

In [7]:
data = np.random.randn(4,3)
data

array([[ 0.99079936,  1.63981   ,  0.77940548],
       [ 0.59491599, -0.94506531, -0.76645766],
       [ 0.50189105, -0.68247579,  0.18935435],
       [-0.939108  ,  0.14965498, -0.92938346]])

In [8]:
data_frame = pd.DataFrame(data)
data_frame

          0         1         2
0  0.990799  1.639810  0.779405
1  0.594916 -0.945065 -0.766458
2  0.501891 -0.682476  0.189354
3 -0.939108  0.149655 -0.929383

In [9]:
print(type(data_frame))
print(type(data_frame[0]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [10]:
new_data_frame = pd.DataFrame(data, index=["Ensar","Erva","Zümra","Hilal"], columns=["Maaş", "Yaş","Tecrübe"])
new_data_frame

           Maaş       Yaş   Tecrübe
Ensar  0.990799  1.639810  0.779405
Erva   0.594916 -0.945065 -0.766458
Zümra  0.501891 -0.682476  0.189354
Hilal -0.939108  0.149655 -0.929383

In [11]:
new_data_frame.iloc[0] # satıra göre arama yapma --> loc[Ensar] da aynısını verir

Maaş       0.990799
Yaş        1.639810
Tecrübe    0.779405
Name: Ensar, dtype: float64

# Data Manipulation

In [12]:
new_data_frame["Ekstra"]=10
new_data_frame

           Maaş       Yaş   Tecrübe  Ekstra
Ensar  0.990799  1.639810  0.779405      10
Erva   0.594916 -0.945065 -0.766458      10
Zümra  0.501891 -0.682476  0.189354      10
Hilal -0.939108  0.149655 -0.929383      10

In [13]:
new_data_frame.drop("Ekstra", axis=1, inplace=True) # inplace içinde bunu yap , axis=1 demezsen satırı siler
new_data_frame                                      # new_data_frame = new_data_frame.drop("Ekstra",axis=1) de denebilir.

           Maaş       Yaş   Tecrübe
Ensar  0.990799  1.639810  0.779405
Erva   0.594916 -0.945065 -0.766458
Zümra  0.501891 -0.682476  0.189354
Hilal -0.939108  0.149655 -0.929383

In [14]:
new_data_frame.loc["Ensar","Maaş"]=100
new_data_frame

             Maaş       Yaş   Tecrübe
Ensar  100.000000  1.639810  0.779405
Erva     0.594916 -0.945065 -0.766458
Zümra    0.501891 -0.682476  0.189354
Hilal   -0.939108  0.149655 -0.929383

In [15]:
print(new_data_frame[new_data_frame>0])
print()
print(new_data_frame[new_data_frame["Yaş"]>0])

             Maaş       Yaş   Tecrübe
Ensar  100.000000  1.639810  0.779405
Erva     0.594916       NaN       NaN
Zümra    0.501891       NaN  0.189354
Hilal         NaN  0.149655       NaN

             Maaş       Yaş   Tecrübe
Ensar  100.000000  1.639810  0.779405
Hilal   -0.939108  0.149655 -0.929383

# Read Excel & CSV

In [16]:
weather_df = pd.read_excel('6-weather.xlsx')
weather_df

   Istanbul  New York  Amsterdam  Paris
0        20        10         15     12
1        21        10         17     14
2        20        13         18     15
3        22        14         19     18
4        25        15         15     20
5        28        13         22     16
6        15        12         15     15
7        20        15         14     14
8        22        16         16     16

In [17]:
print(weather_df.head())
print()
print(weather_df.tail())

   Istanbul  New York  Amsterdam  Paris
0        20        10         15     12
1        21        10         17     14
2        20        13         18     15
3        22        14         19     18
4        25        15         15     20

   Istanbul  New York  Amsterdam  Paris
4        25        15         15     20
5        28        13         22     16
6        15        12         15     15
7        20        15         14     14
8        22        16         16     16

In [18]:
weather_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Istanbul   9 non-null      int64
 1   New York   9 non-null      int64
 2   Amsterdam  9 non-null      int64
 3   Paris      9 non-null      int64
dtypes: int64(4)
memory usage: 420.0 bytes

In [19]:
weather_df.describe()

        Istanbul   New York  Amsterdam      Paris
count   9.000000   9.000000   9.000000   9.000000
mean   21.444444  13.111111  16.777778  15.555556
std     3.609401   2.147350   2.538591   2.351123
min    15.000000  10.000000  14.000000  12.000000
25%    20.000000  12.000000  15.000000  14.000000
50%    21.000000  13.000000  16.000000  15.000000
75%    22.000000  15.000000  18.000000  16.000000
max    28.000000  16.000000  22.000000  20.000000

In [20]:
print(weather_df.isna())
print()
print(weather_df.count())

   Istanbul  New York  Amsterdam  Paris
0     False     False      False  False
1     False     False      False  False
2     False     False      False  False
3     False     False      False  False
4     False     False      False  False
5     False     False      False  False
6     False     False      False  False
7     False     False      False  False
8     False     False      False  False

Istanbul     9
New York     9
Amsterdam    9
Paris        9
dtype: int64

# Working With Missing Data

In [21]:
weather_na_df = pd.read_excel('6-weatherna.xlsx')
weather_na_df

   Istanbul  New York  Amsterdam  Paris
0      20.0      10.0       15.0   12.0
1      21.0      10.0        NaN   14.0
2       NaN      13.0       18.0   15.0
3      22.0      14.0       19.0   18.0
4      25.0      15.0       15.0   20.0
5      28.0       NaN       22.0    NaN
6      15.0      12.0       15.0   15.0
7      20.0      15.0       14.0    NaN
8      22.0      16.0       16.0    NaN

In [22]:
print(weather_na_df.dropna())
print()
print(weather_na_df.fillna(20))

   Istanbul  New York  Amsterdam  Paris
0      20.0      10.0       15.0   12.0
3      22.0      14.0       19.0   18.0
4      25.0      15.0       15.0   20.0
6      15.0      12.0       15.0   15.0

   Istanbul  New York  Amsterdam  Paris
0      20.0      10.0       15.0   12.0
1      21.0      10.0       20.0   14.0
2      20.0      13.0       18.0   15.0
3      22.0      14.0       19.0   18.0
4      25.0      15.0       15.0   20.0
5      28.0      20.0       22.0   20.0
6      15.0      12.0       15.0   15.0
7      20.0      15.0       14.0   20.0
8      22.0      16.0       16.0   20.0

In [23]:
print(weather_na_df.mean())
print()
print(weather_na_df.median())

Istanbul     21.625000
New York     13.125000
Amsterdam    16.750000
Paris        15.666667
dtype: float64

Istanbul     21.5
New York     13.5
Amsterdam    15.5
Paris        15.0
dtype: float64

In [24]:
# Ortalama ile doldurma
weather_na_df.fillna(weather_na_df.mean())

   Istanbul  New York  Amsterdam      Paris
0    20.000    10.000      15.00  12.000000
1    21.000    10.000      16.75  14.000000
2    21.625    13.000      18.00  15.000000
3    22.000    14.000      19.00  18.000000
4    25.000    15.000      15.00  20.000000
5    28.000    13.125      22.00  15.666667
6    15.000    12.000      15.00  15.000000
7    20.000    15.000      14.00  15.666667
8    22.000    16.000      16.00  15.666667

# Group By

In [26]:
employee_df = pd.read_csv('6-employee.csv')
employee_df

   Department Employee  Salary  Experience           City
0   Marketing    Emp_1   53483           1       New York
1       Sales    Emp_2   78555           8         Austin
2     Finance    Emp_3   47159           3         Austin
3       Sales    Emp_4  110077           3  San Francisco
4       Sales    Emp_5   65920           1       New York
5          IT    Emp_6   97121          11        Chicago
6     Finance    Emp_7   99479           5        Chicago
7     Finance    Emp_8  119475          10       New York
8     Finance    Emp_9   49457           7        Chicago
9       Sales   Emp_10   96557          10        Chicago
10  Marketing   Emp_11  107189           9       New York
11    Finance   Emp_12  108953          12         Austin
12      Sales   Emp_13   82995           7       New York
13         IT   Emp_14   70757           9         Austin
14  Marketing   Emp_15   39692           8        Chicago
15         IT   Emp_16   75758          12        Chicago
16  Marketing   Emp_17  102409           2        Chicago
17      Sales   Emp_18  101211           1  San Francisco
18         HR   Emp_19   95697           7         Austin
19  Marketing   Emp_20   67065           7  San Francisco
20         IT   Emp_21   62606          14  San Francisco
21      Sales   Emp_22   41534           8       New York
22  Marketing   Emp_23   70397           5  San Francisco
23         HR   Emp_24   31016           3       New York
24         HR   Emp_25  119789          12       New York
25    Finance   Emp_26   85591           8  San Francisco
26    Finance   Emp_27  119812           6         Austin
27         IT   Emp_28   53247          11         Austin
28  Marketing   Emp_29   54300           3         Austin
29  Marketing   Emp_30  104065           1         Austin
30    Finance   Emp_31  112798           3         Austin
31  Marketing   Emp_32   39268           5  San Francisco
32  Marketing   Emp_33  116807          14  San Francisco
33         HR   Emp_34   42185           3        Chicago
34    Finance   Emp_35   93704           1         Austin
35      Sales   Emp_36  116779           5  San Francisco
36    Finance   Emp_37   69099          10        Chicago
37      Sales   Emp_38   38571           7         Austin
38         HR   Emp_39   68044          14       New York
39         IT   Emp_40   81214           7        Chicago
40  Marketing   Emp_41   91228          11  San Francisco
41         HR   Emp_42   78984           9       New York
42  Marketing   Emp_43   70774          10       New York
43         IT   Emp_44   32568          10       New York
44         IT   Emp_45   92592          12        Chicago
45         HR   Emp_46   97563          13  San Francisco
46         IT   Emp_47   32695           3       New York
47      Sales   Emp_48   78190           7         Austin
48         IT   Emp_49   35258           1       New York
49  Marketing   Emp_50  117538           4       New York

In [30]:
print(employee_df.describe())
print()
print(employee_df[employee_df['Experience']>6].count())

              Salary  Experience
count      50.000000   50.000000
mean    78344.500000    7.060000
std     27817.603904    3.966235
min     31016.000000    1.000000
25%     53687.250000    3.000000
50%     78769.500000    7.000000
75%    100778.000000   10.000000
max    119812.000000   14.000000

Department    30
Employee      30
Salary        30
Experience    30
City          30
dtype: int64

In [33]:
df_grouped = employee_df.groupby('Department')
df_grouped.count()

            Employee  Salary  Experience  City
Department
Finance           10      10          10    10
HR                 7       7           7     7
IT                10      10          10    10
Marketing         13      13          13    13
Sales             10      10          10    10

In [34]:
df_grouped['Salary'].mean()

Department
Finance      90552.700000
HR           76182.571429
IT           63381.600000
Marketing    79555.000000
Sales        81038.900000
Name: Salary, dtype: float64

# Concat & Merge

In [35]:
df1 = pd.read_csv('7-concat_data1.csv')
df1

   Employee_ID    Name Department
0            1   Emp_1    Finance
1            2   Emp_2  Marketing
2            3   Emp_3         HR
3            4   Emp_4    Finance
4            5   Emp_5    Finance
5            6   Emp_6  Marketing
6            7   Emp_7         HR
7            8   Emp_8         HR
8            9   Emp_9    Finance
9           10  Emp_10         IT

In [36]:
df2 = pd.read_csv('7-concat_data2.csv')
df2

   Employee_ID    Name Department
0           11  Emp_11    Finance
1           12  Emp_12    Finance
2           13  Emp_13    Finance
3           14  Emp_14    Finance
4           15  Emp_15  Marketing
5           16  Emp_16         HR
6           17  Emp_17  Marketing
7           18  Emp_18  Marketing
8           19  Emp_19  Marketing
9           20  Emp_20    Finance

In [40]:
# concat
df_concat = pd.concat([df1,df2],ignore_index=True)
df_concat

    Employee_ID    Name Department
0             1   Emp_1    Finance
1             2   Emp_2  Marketing
2             3   Emp_3         HR
3             4   Emp_4    Finance
4             5   Emp_5    Finance
5             6   Emp_6  Marketing
6             7   Emp_7         HR
7             8   Emp_8         HR
8             9   Emp_9    Finance
9            10  Emp_10         IT
10           11  Emp_11    Finance
11           12  Emp_12    Finance
12           13  Emp_13    Finance
13           14  Emp_14    Finance
14           15  Emp_15  Marketing
15           16  Emp_16         HR
16           17  Emp_17  Marketing
17           18  Emp_18  Marketing
18           19  Emp_19  Marketing
19           20  Emp_20    Finance

In [41]:
# merge
df_merge1 = pd.read_csv('7-merge_data1.csv')
df_merge2 = pd.read_csv('7-merge_data2.csv')

In [42]:
print(df_merge1)
print()
print(df_merge2)

   Employee_ID    Name Department
0            1   Emp_1         IT
1            2   Emp_2         HR
2            3   Emp_3         IT
3            4   Emp_4  Marketing
4            5   Emp_5  Marketing
5            6   Emp_6         IT
6            7   Emp_7         IT
7            8   Emp_8         IT
8            9   Emp_9  Marketing
9           10  Emp_10  Marketing

   Employee_ID  Salary  Experience
0            5   55658           3
1            1  114478           5
2           12   48431          19
3           10   32747           7
4            6   89150           9
5           13   95725           7
6            9   65773           4
7           11   86886          18

In [43]:
# merge - outer join
df_merge_outer = pd.merge(df_merge1, df_merge2 , on="Employee_ID", how="outer")
df_merge_outer

    Employee_ID    Name Department    Salary  Experience
0             1   Emp_1         IT  114478.0         5.0
1             2   Emp_2         HR       NaN         NaN
2             3   Emp_3         IT       NaN         NaN
3             4   Emp_4  Marketing       NaN         NaN
4             5   Emp_5  Marketing   55658.0         3.0
5             6   Emp_6         IT   89150.0         9.0
6             7   Emp_7         IT       NaN         NaN
7             8   Emp_8         IT       NaN         NaN
8             9   Emp_9  Marketing   65773.0         4.0
9            10  Emp_10  Marketing   32747.0         7.0
10           11     NaN        NaN   86886.0        18.0
11           12     NaN        NaN   48431.0        19.0
12           13     NaN        NaN   95725.0         7.0

In [44]:
# merge - left join
df_merge_left = pd.merge(df_merge1, df_merge2 , on="Employee_ID", how="left")
df_merge_left

   Employee_ID    Name Department    Salary  Experience
0            1   Emp_1         IT  114478.0         5.0
1            2   Emp_2         HR       NaN         NaN
2            3   Emp_3         IT       NaN         NaN
3            4   Emp_4  Marketing       NaN         NaN
4            5   Emp_5  Marketing   55658.0         3.0
5            6   Emp_6         IT   89150.0         9.0
6            7   Emp_7         IT       NaN         NaN
7            8   Emp_8         IT       NaN         NaN
8            9   Emp_9  Marketing   65773.0         4.0
9           10  Emp_10  Marketing   32747.0         7.0

In [45]:
# merge - right join
df_merge_right = pd.merge(df_merge1, df_merge2 , on="Employee_ID", how="right")
df_merge_right

   Employee_ID    Name Department  Salary  Experience
0            5   Emp_5  Marketing   55658           3
1            1   Emp_1         IT  114478           5
2           12     NaN        NaN   48431          19
3           10  Emp_10  Marketing   32747           7
4            6   Emp_6         IT   89150           9
5           13     NaN        NaN   95725           7
6            9   Emp_9  Marketing   65773           4
7           11     NaN        NaN   86886          18

In [46]:
# merge - inner join
df_merge_inner = pd.merge(df_merge1, df_merge2 , on="Employee_ID", how="inner")
df_merge_inner

   Employee_ID    Name Department  Salary  Experience
0            1   Emp_1         IT  114478           5
1            5   Emp_5  Marketing   55658           3
2            6   Emp_6         IT   89150           9
3            9   Emp_9  Marketing   65773           4
4           10  Emp_10  Marketing   32747           7

# Apply

In [47]:
df_apply = pd.read_csv('8-apply_function_data.csv')
df_apply

    Employee_ID     Name Department  Salary  Experience  Performance_Score
0             1    Emp_1  Marketing   82251           6                  5
1             2    Emp_2      Sales   52662          24                  3
2             3    Emp_3    Finance   38392           5                  3
3             4    Emp_4      Sales   60535          20                  3
4             5    Emp_5      Sales  108603           2                  2
..          ...      ...        ...     ...         ...                ...
95           96   Emp_96    Finance   93734          19                  4
96           97   Emp_97      Sales  100467          22                  2
97           98   Emp_98         IT   82662          23                  3
98           99   Emp_99         IT   42688          22                  1
99          100  Emp_100         HR   55342          14                  3

[100 rows x 6 columns]

In [48]:
def salary_categry(salary):
    if salary < 50000:
        return "Low"
    elif 50000 <= salary < 80000:
        return "Medium"
    else:
        return "High"

In [53]:
df_apply["Salary_Category"]= df_apply["Salary"].apply(salary_categry)
df_apply[1:15]

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,Salary_Category
1,2,Emp_2,Sales,52662,24,3,Medium
2,3,Emp_3,Finance,38392,5,3,Low
3,4,Emp_4,Sales,60535,20,3,Medium
4,5,Emp_5,Sales,108603,2,2,High
5,6,Emp_6,IT,82256,6,5,High
6,7,Emp_7,Finance,119135,22,1,High
7,8,Emp_8,Finance,65222,11,4,Medium
8,9,Emp_9,Finance,107373,16,1,High
9,10,Emp_10,Sales,109575,16,5,High
10,11,Emp_11,Marketing,114651,1,4,High
11,12,Emp_12,Finance,93335,9,5,High
12,13,Emp_13,Sales,40965,6,3,Low
13,14,Emp_14,IT,54538,16,4,Medium
14,15,Emp_15,Marketing,100592,3,3,High

In [64]:
# if experience > 10 --> performance_score + 1
def adjust_performance(row):
    if row["Experience"] > 10:
        return row["Performance_Score"] + 1
    else:
        return row["Performance_Score"]

In [68]:
df_apply["New_Score"] = df_apply.apply(adjust_performance, axis=1)
df_apply

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,Salary_Category,New_Score
0,1,Emp_1,Marketing,82251,6,5,High,5
1,2,Emp_2,Sales,52662,24,3,Medium,4
2,3,Emp_3,Finance,38392,5,3,Low,3
3,4,Emp_4,Sales,60535,20,3,Medium,4
4,5,Emp_5,Sales,108603,2,2,High,2
...,...,...,...,...,...,...,...,...
95,96,Emp_96,Finance,93734,19,4,High,5
96,97,Emp_97,Sales,100467,22,2,High,3
97,98,Emp_98,IT,82662,23,3,High,4
98,99,Emp_99,IT,42688,22,1,Low,2
99,100,Emp_100,HR,55342,14,3,Medium,4

In [70]:
# Emp_1 --> Emp 1
df_apply["Formatted_Name"] = df_apply["Name"].apply(lambda x : x.replace("_"," "))
df_apply

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,Salary_Category,New_Score,Formatted_Name
0,1,Emp_1,Marketing,82251,6,5,High,5,Emp 1
1,2,Emp_2,Sales,52662,24,3,Medium,4,Emp 2
2,3,Emp_3,Finance,38392,5,3,Low,3,Emp 3
3,4,Emp_4,Sales,60535,20,3,Medium,4,Emp 4
4,5,Emp_5,Sales,108603,2,2,High,2,Emp 5
...,...,...,...,...,...,...,...,...,...
95,96,Emp_96,Finance,93734,19,4,High,5,Emp 96
96,97,Emp_97,Sales,100467,22,2,High,3,Emp 97
97,98,Emp_98,IT,82662,23,3,High,4,Emp 98
98,99,Emp_99,IT,42688,22,1,Low,2,Emp 99
99,100,Emp_100,HR,55342,14,3,Medium,4,Emp 100